Autodesk.Revit.DB.OrdinateDimensionLineStyle
The ordinate dimension line style.
Since:
2017 Subscription Update
Since:
2017 Subscription Update

Autodesk.Revit.DB.OrdinateDimensionLineStyle.Segmented
Segments the dimension line. Specify the length of the segments with the DimensionLineLength property.

Autodesk.Revit.DB.OrdinateDimensionLineStyle.Continuous
Displays the dimension line as continuous.

Autodesk.Revit.DB.OrdinateDimensionLineStyle.None
Shows no dimension line. When you select the dimension line in the drawing area, a hidden line displays.